In [1]:
import pandas as pd
from sklearn.ensemble import RandomForestClassifier

In [2]:
# sibsp Número de irmãos / cônjuges a bordo
# Parch Número de pais / filhos a bordo 
# Embarked = Porto de embarque (C = Cherbourg; Q = Queenstown; S = Southampton)

In [3]:
db_titanic_train = pd.read_csv('../database/train.csv',sep= ',')
db_titanic_test = pd.read_csv('../database/test.csv',sep=',')
#db_titanic_train.head()

In [4]:
#print(db_titanic_train.count())

In [7]:
inf_female = db_titanic_train.loc[db_titanic_train.Sex == 'female'].count()
#inf_female

In [336]:
inf_male = db_titanic_train.loc[db_titanic.Sex == 'male'].count()
#inf_male

In [337]:
print('Embarked more men {} than women {}'.format(inf_male['Embarked'],inf_female['Embarked']))

Embarked more men 577 than women 312

In [338]:
family_relationship = db_titanic_train.loc[
                                    (db_titanic.SibSp == 1) & (db_titanic.Parch  == 1), 
                                    ['Sex','SibSp','Parch']].count()
print('We have some kind of family relationship \n',family_relationship)

We have some kind of family relationship
 Sex      57
SibSp    57
Parch    57
dtype: int64

In [339]:
age_female = db_titanic_train.loc[
                            (db_titanic_train.Sex == 'female') & (db_titanic_train.Age <= 15),
                            ['Sex']].count()
print('Total women under 15 years old {}'.format(age_female))

Total women under 15 years old Sex    43
dtype: int64

In [340]:
age_male = db_titanic_train.loc[
                        (db_titanic_train.Sex == 'male') & (db_titanic_train.Age <= 15),
                        ['Sex']].count()
print('Total men under 15 years old {}'.format(age_male))

Total men under 15 years old Sex    40
dtype: int64

In [341]:
unknown_age = db_titanic_train['Sex'].count() - db_titanic_train['Age'].count()
print('We have a number of {} people we dont know their age '.format(unknown_age))

We have a number of 177 people we dont know their age

In [342]:
"""
change the Nan value to 0 
"""
db_titanic_train['Cabin'] = db_titanic_train['Cabin'].fillna(0)
db_titanic_train['Age'] = db_titanic_train['Age'].fillna(0) 
db_titanic_train['Embarked'] = db_titanic_train['Embarked'].fillna(0) 

db_titanic_test['Cabin'] = db_titanic_test['Cabin'].fillna(0)
db_titanic_test['Age'] = db_titanic_test['Age'].fillna(0) 
db_titanic_test['Embarked'] = db_titanic_test['Embarked'].fillna(0) 


#db_titanic_train.head()

In [343]:
sex = db_titanic_train['Sex'].count()

col_survived = db_titanic_train.loc[db_titanic_train['Survived'] == 1]
col_dead = db_titanic_train.loc[db_titanic_train['Survived'] == 0]

result_survived = sex - col_survived.loc[:,'Survived'].count()
result_dead = sex - col_dead.loc[:,'Survived'].count()

print('survived => {} | dead => {}'.format(result_survived,result_dead))

survived => 549 | dead => 342

In [344]:
nova_dataframe = db_titanic_train[['Name','Sex','Age']]

dfemale_31_40 = db_titanic_train.loc[(
        db_titanic_train.Sex == 'female') & (
        db_titanic_train.Age >= 31) & 
        (db_titanic_train.Age <= 40)]
#dfemale_31_40

In [345]:
dfemale_41_50 = db_titanic_train.loc[(
        db_titanic_train.Sex == 'female') & (
        db_titanic_train.Age >= 41) & 
        (db_titanic_train.Age <= 50)]
#dfemale_41_50

dfemale_51_60 = db_titanic_train.loc[(
        db_titanic_train.Sex == 'female') & (
        db_titanic_train.Age >= 51) & 
        (db_titanic_train.Age <= 60)]
#dfemale_51_60

dfemale_61_70 = db_titanic_train.loc[(
        db_titanic_train.Sex == 'female') & (
        db_titanic_train.Age >= 61) & 
        (db_titanic_train.Age <= 70)]
#dfemale_61_70

In [346]:
import csv
import re

file_train_csv = '../database/train.csv'
file_test_csv = '../database/test.csv'

db_titanic_train['Age'] = db_titanic_train['Age'].astype(int)
db_titanic_test['Age'] = db_titanic_test['Age'].astype(int)


re_miss = '(Miss)'
re_mrs = '(Mrs)'
re_mr = '(Mr)'

"""
legend
colunm classe
Miss = 1 | Mrs = 2 | Mr = 3

colunm Sex
male = 1 | female = 2
"""

lista_train = []
lista_test = []

with open(file_train_csv, 'r') as f:
    csv_reader = csv.DictReader(f)
    for line in csv_reader:
        
        if re.search(re_miss,line['Name']):
            lista_test.append(1)
            
        elif re.search(re_mrs,line['Name']):
            lista_test.append(2)
        
        elif re.search(re_mr,line['Name']):
            lista_test.append(3)

db_titanic_train.insert(4,'classe', pd.Series(lista_train))

db_titanic_train.Sex[db_titanic_train.Sex == 'male'] = 1
db_titanic_train.Sex[db_titanic_train.Sex == 'female'] = 2

classification_train  = db_titanic_train['classe'].isnull().sum()
print('Base Train => we have {} rating people who are not classified as Mrs, Miss and Mr'.format(classification_train))

db_titanic_train

Base Train => we have 891 rating people who are not classified as Mrs, Miss and Mr
<ipython-input-346-327adc6d0ae5>:43: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  db_titanic_train.Sex[db_titanic_train.Sex == 'male'] = 1
<ipython-input-346-327adc6d0ae5>:44: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  db_titanic_train.Sex[db_titanic_train.Sex == 'female'] = 2

,PassengerId,Survived,Pclass,Name,classe,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",NaN,1,22,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,2,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",NaN,2,26,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,2,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",NaN,1,35,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",NaN,1,27,0,0,211536,13.0000,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",NaN,2,19,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,2,0,1,2,W./C. 6607,23.4500,0,S
889,890,1,1,"Behr, Mr. Karl Howell",NaN,1,26,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",NaN,1,32,0,0,370376,7.7500,0,Q

In [347]:

with open(file_test_csv, 'r') as f:
    csv_reader = csv.DictReader(f)
    for line in csv_reader:
        
        if re.search(re_miss,line['Name']):
            lista_test.append(1)
            
        elif re.search(re_mrs,line['Name']):
            lista_test.append(2)
        
        elif re.search(re_mr,line['Name']):
            lista_test.append(3)

db_titanic_test.insert(4,'classe', pd.Series(lista_test))

classification_test  = db_titanic_test['classe'].isnull().sum()
print('Base Test => we have {} rating people who are not classified as Mrs, Miss and Mr'.format(classification_test))

db_titanic_test.Sex[db_titanic_test.Sex == 'male'] = 1
db_titanic_test.Sex[db_titanic_test.Sex == 'female'] = 2

db_titanic_test

Base Test => we have 0 rating people who are not classified as Mrs, Miss and Mr
<ipython-input-347-dedd09738a1b>:19: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  db_titanic_test.Sex[db_titanic_test.Sex == 'male'] = 1
<ipython-input-347-dedd09738a1b>:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  db_titanic_test.Sex[db_titanic_test.Sex == 'female'] = 2

,PassengerId,Pclass,Name,Sex,classe,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,3,34,0,0,330911,7.8292,0,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",2,2,47,1,0,363272,7.0000,0,S
2,894,2,"Myles, Mr. Thomas Francis",1,1,62,0,0,240276,9.6875,0,Q
3,895,3,"Wirz, Mr. Albert",1,2,27,0,0,315154,8.6625,0,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",2,3,22,1,1,3101298,12.2875,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,1,0,0,0,A.5. 3236,8.0500,0,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",2,3,39,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",1,1,38,0,0,SOTON/O.Q. 3101262,7.2500,0,S
416,1308,3,"Ware, Mr. Frederick",1,3,0,0,0,359309,8.0500,0,S
417,1309,3,"Peter, Master. Michael J",1,3,0,1,1,2668,22.3583,0,C

In [8]:
from sklearn.cluster import KMeans
import matplotlib.pyplot as plt
import seaborn as snss

x_train = db_titanic_train[['classe','Sex','Age']]

db_titanic_train

y_test = db_titanic_test[['classe','Sex','Age']]

kmeans = KMeans(n_clusters=4, random_state=1)
kmeans.fit_predict(x_train)

plt.scatter(x = x_train)
plt.xlabel('Sex')
plt.ylabel('Age')
plt.title('Relação entre sexo e idade')
plt.show()

KeyError: "['classe'] not in index"